tyt319/strain-rosette/Package/SVD/APM32F402.svd
            </registers>
        </peripheral><peripheral derivedFrom="DMA2">
            <name>DMA1</name>
            <baseAddress>0x40020000</baseAddress>
            <interrupt>
                <name>DMA2_Channel1</name><description>DMA2 Channel1 global interrupt</description><value>56</value>
                
                
            </interrupt>
            <interrupt>
                <name>DMA2_Channel2</name><description>DMA2 Channel2 global interrupt</description><value>57</value>
                
                
            </interrupt>
            <interrupt>
                <name>DMA2_Channel3</name><description>DMA2 Channel3 global interrupt</description><value>58</value>
                
                
            </interrupt>
            <interrupt>
                <name>DMA2_Channel4_5</name><description>DMA2 Channel4 and DMA2 Channel5 global
        interrupt</description><value>59</value>
                
                
            </interrupt>
            
            
            
        </peripheral>
        
        
        <peripheral><name>FMC</name><description>Flash memory controller</description><groupName>FMC</groupName><baseAddress>0x40022000</baseAddress><addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock><interrupt>
                <name>FLASH</name>
                <description>Flash global interrupt</description>
                <value>4</value>
            </interrupt><registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>Flash access control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    
                    <resetValue>0x00008030</resetValue>
                    <fields>
                        <field>
                            <name>WS2_0</name>
                            <description>Wait State Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth><access>read-write</access>
                        </field>
                        <field>
                            <name>HCAEN</name>
                            <description>Flash Half Cycle Access Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth><access>read-write</access>
                        </field><field><name>PBEN</name><description>Prefetch Buffer Enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PBSF</name><description>Prefetch Buffer Status Flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>WS4_3</name><description>Wait State Configure</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ICACHEEN</name><description>Instruction cache enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCACHEEN</name><description>Data cache enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ICACHERST</name><description>Instruction cache reset</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>DCACHERST</name><description>Data cache reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRFTB</name><description>Prefetch Control</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                    </fields>
                </register>
                
                
                
                
                
                
                
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>Flash key register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>key</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        
                        
                    </fields>
                </register><register><name>OBKEY</name><displayName>OBKEY</displayName><description>Option byte key register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields>
                        <field>
                            <name>OBKEY</name>
                            <description>Option byte key</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                    </fields></register><register><name>STS</name><displayName>STS</displayName><description>Status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields>
                        <field>
                            <name>BUSYF</name>
                            <description>Busy</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth><access>read-only</access>
                        </field>
                        <field>
                            <name>PEF</name>
                            <description>Programming error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth><access>read-write</access>
                        </field><field><name>WPEF</name><description>Write protection error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OCF</name><description>End of operation</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                    </fields></register><register><name>CTRL2</name><displayName>CTRL2</displayName><description>Control register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields>
                        <field>
                            <name>PG</name>
                            <description>Programming</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field><name>PAGEERA</name><description>Page Erase</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field>
							<name>MASSERA</name>
							<description>Mass Erase</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OBP</name>
							<description>Option byte programming</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OBE</name>
							<description>Option byte erase</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STA</name>
							<description>Start</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>LOCK</name>
							<description>Lock</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OBWEN</name>
							<description>Option bytes write enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ERRIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>OCIE</name>
							<description>End of operation interrupt enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                    </fields></register><register><name>ADDR</name><displayName>ADDR</displayName><description>Flash address register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields>
						<field>
							<name>ADDR</name>
							<description>Flash Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields></register><register><name>OBCS</name><displayName>OBCS</displayName><description>Option byte register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x03FFFFFC</resetValue><fields>
                        <field>
                            <name>OBE</name>
                            <description>Option byte error</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field><name>READPROT</name><description>Read protection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UOB</name><description>User Option Byte</description><bitOffset>2</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>Data0</description><bitOffset>10</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>Data1</description><bitOffset>18</bitOffset><bitWidth>8</bitWidth></field>
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
                        
