tyt319/strain-rosette/Package/SVD/APM32F402.svd
                <register>
                    <name>REGSEQ1</name>
                    <displayName>REGSEQ1</displayName>
                    <description>regular sequence register 1</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGSEQLEN</name>
                            <description>Regular channel sequence length</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC16</name>
                            <description>16th conversion in regular sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC15</name>
                            <description>15th conversion in regular sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC14</name>
                            <description>14th conversion in regular sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC13</name>
                            <description>13th conversion in regular sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGSEQ2</name>
                    <displayName>REGSEQ2</displayName>
                    <description>regular sequence register 2</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGSEQC12</name>
                            <description>12th conversion in regular sequence</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC11</name>
                            <description>11th conversion in regular sequence</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC10</name>
                            <description>10th conversion in regular sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC9</name>
                            <description>9th conversion in regular sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC8</name>
                            <description>8th conversion in regular sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC7</name>
                            <description>7th conversion in regular sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGSEQ3</name>
                    <displayName>REGSEQ3</displayName>
                    <description>regular sequence register 3</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGSEQC6</name>
                            <description>6th conversion in regular sequence</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC5</name>
                            <description>5th conversion in regular sequence</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC4</name>
                            <description>4th conversion in regular sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC3</name>
                            <description>3rd conversion in regular sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC2</name>
                            <description>2nd conversion in regular sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC1</name>
                            <description>1st conversion in regular sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJSEQ</name>
                    <displayName>INJSEQ</displayName>
                    <description>injected sequence register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJSEQLEN</name>
                            <description>Injected sequence length</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC4</name>
                            <description>4th conversion in injected sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC3</name>
                            <description>3rd conversion in injected sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC2</name>
                            <description>2nd conversion in injected sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC1</name>
                            <description>1st conversion in injected sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA1</name>
                    <displayName>INJDATA1</displayName>
                    <description>injected data register x</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA2</name>
                    <displayName>INJDATA2</displayName>
                    <description>injected data register x</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA3</name>
                    <displayName>INJDATA3</displayName>
                    <description>injected data register x</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA4</name>
                    <displayName>INJDATA4</displayName>
                    <description>injected data register x</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGDATA</name>
                    <displayName>REGDATA</displayName>
                    <description>regular data register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGDATA</name>
                            <description>Regular data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        
                    </fields>
                </register>
