tyt319/strain-rosette/Package/SVD/APM32F402.svd
                <register>
                    <name>TXDLEN2</name>
                    <displayName>TXDLEN2</displayName>
                    <description>CAN Send the mailbox data length and timestamp register 2</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLCODE</name>
                            <description>DLCODE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        
                        
                    </fields>
                </register>
                <register>
                    <name>TXMDL2</name>
                    <displayName>TXMDL2</displayName>
                    <description>CAN Send mailbox low byte data register 2</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE0</name>
                            <description>DATABYTE0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>DATABYTE1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>DATABYTE2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE3</name>
                            <description>DATABYTE3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDH2</name>
                    <displayName>TXMDH2</displayName>
                    <description>CAN Send mailbox High byte data register2</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE4</name>
                            <description>DATABYTE4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>DATABYTE5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>DATABYTE6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE7</name>
                            <description>DATABYTE7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMID0</name>
                    <displayName>RXMID0</displayName>
                    <description>CAN Each mailbox contains the receive mailbox identifier register 0</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFTXREQ</name>
                            <description>RFTXREQ</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>IDTYPESEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>EXTID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>STDID</name>
                            <description>STDID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDLEN0</name>
                    <displayName>RXDLEN0</displayName>
                    <description>CAN receive the mailbox data length and timestamp register 0</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLCODE</name>
                            <description>DLCODE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FMIDX</name>
                            <description>FMIDX</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        
                    </fields>
                </register>
                <register>
                    <name>RXMDL0</name>
                    <displayName>RXMDL0</displayName>
                    <description>CAN receive mailbox low byte data register 0</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE0</name>
                            <description>DATABYTE1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>DATABYTE2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>DATABYTE3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE3</name>
                            <description>DATABYTE4</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMDH0</name>
                    <displayName>RXMDH0</displayName>
                    <description>CAN receive mailbox High byte data register 0</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE4</name>
                            <description>DATABYTE5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>DATABYTE6</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>DATABYTE7</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE7</name>
                            <description>DATABYTE8</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMID1</name>
                    <displayName>RXMID1</displayName>
                    <description>CAN Each mailbox contains the receive mailbox identifier register 1</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFTXREQ</name>
                            <description>RFTXREQ</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>IDTYPESEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>EXTID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>STDID</name>
                            <description>STDID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDLEN1</name>
                    <displayName>RXDLEN1</displayName>
                    <description>CAN receive the mailbox data length and timestamp register 1</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLCODE</name>
                            <description>DLCODE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FMIDX</name>
                            <description>FMIDX</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        
                    </fields>
                </register>
                <register>
                    <name>RXMDL1</name>
                    <displayName>RXMDL1</displayName>
                    <description>CAN receive mailbox low byte data register 1</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE0</name>
                            <description>DATABYTE1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>DATABYTE2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>DATABYTE3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE3</name>
                            <description>DATABYTE4</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMDH1</name>
                    <displayName>RXMDH1</displayName>
                    <description>CAN receive mailbox High byte data register 1</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE4</name>
                            <description>DATABYTE5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>DATABYTE6</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>DATABYTE7</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE7</name>
                            <description>DATABYTE8</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCTRL</name>
                    <displayName>FCTRL</displayName>
                    <description>CAN Filter the master control register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FINITEN</name>
                            <description>FINITEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field><field>
                            <name>CAN2SB</name>
                            <description>CAN2SB</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
