tyt319/strain-rosette/Package/SVD/APM32F402.svd
                <register>
                    <name>HCHIMASK1</name>
                    <displayName>HCHIMASK1</displayName>
                    <description>OTG_FS host channel-1 mask register
          (OTG_FS_HCINTMSK1)</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHIMASK2</name>
                    <displayName>HCHIMASK2</displayName>
                    <description>OTG_FS host channel-2 mask register
          (OTG_FS_HCINTMSK2)</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHIMASK3</name>
                    <displayName>HCHIMASK3</displayName>
                    <description>OTG_FS host channel-3 mask register
          (OTG_FS_HCINTMSK3)</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHIMASK4</name>
                    <displayName>HCHIMASK4</displayName>
                    <description>OTG_FS host channel-4 mask register
          (OTG_FS_HCINTMSK4)</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHIMASK5</name>
                    <displayName>HCHIMASK5</displayName>
                    <description>OTG_FS host channel-5 mask register
          (OTG_FS_HCINTMSK5)</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHIMASK6</name>
                    <displayName>HCHIMASK6</displayName>
                    <description>OTG_FS host channel-6 mask register
          (OTG_FS_HCINTMSK6)</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
